Tekla.Structures.Geometry3d.OBB
The OBB class represents an oriented 3d bounding box.
using System;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
OBB obb = null;
// In this simplified example, there are two existing beams in the model.
ModelObjectEnumerator beamsEnumerator =
TeklaModel.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.BEAM);
if (beamsEnumerator != null)
{
while (beamsEnumerator.MoveNext())
{
Beam beam = beamsEnumerator.Current as Beam;
if (beam != null)
{
if (obb == null)
{
obb = CreateOrientedBoundingBox(beam);
}
else
{
if (obb.Intersects(CreateOrientedBoundingBox(beam)))
{
// Boxes intersect.
}
else
{
// Boxes did not intersect.
}
}
}
}
}
}
private Point CalculateCenterPoint(Point min, Point max)
{
double x = min.X + ((max.X - min.X) / 2);
double y = min.Y + ((max.Y - min.Y) / 2);
double z = min.Z + ((max.Z - min.Z) / 2);
return new Point(x, y, z);
}
private OBB CreateOrientedBoundingBox(Beam beam)
{
OBB obb = null;
if (beam != null)
{
WorkPlaneHandler workPlaneHandler = TeklaModel.GetWorkPlaneHandler();
TransformationPlane originalTransformationPlane = workPlaneHandler.GetCurrentTransformationPlane();
Solid solid = beam.GetSolid();
Point minPointInCurrentPlane = solid.MinimumPoint;
Point maxPointInCurrentPlane = solid.MaximumPoint;
Point centerPoint = CalculateCenterPoint(minPointInCurrentPlane, maxPointInCurrentPlane);
CoordinateSystem coordSys = beam.GetCoordinateSystem();
TransformationPlane localTransformationPlane = new TransformationPlane(coordSys);
workPlaneHandler.SetCurrentTransformationPlane(localTransformationPlane);
solid = beam.GetSolid();
Point minPoint = solid.MinimumPoint;
Point maxPoint = solid.MaximumPoint;
double extent0 = (maxPoint.X - minPoint.X) / 2;
double extent1 = (maxPoint.Y - minPoint.Y) / 2;
double extent2 = (maxPoint.Z - minPoint.Z) / 2;
workPlaneHandler.SetCurrentTransformationPlane(originalTransformationPlane);
obb = new OBB(centerPoint, coordSys.AxisX, coordSys.AxisY,
coordSys.AxisX.Cross(coordSys.AxisY), extent0, extent1, extent2);
}
return obb;
}
}

Tekla.Structures.Geometry3d.OBB.InitializationExceptionMessage
Represents an exception message to be thrown when internal OBB initialization fails.

Tekla.Structures.Geometry3d.OBB.RequiredArraySize
Represents a constant required array size for axis and extents.

Tekla.Structures.Geometry3d.OBB.obbInternal
This field is used for storing the wrapped item.

Tekla.Structures.Geometry3d.OBB.#ctor
Initializes a new instance of the Tekla.Structures.Geometry3d.OBB class.

Tekla.Structures.Geometry3d.OBB.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Double,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Geometry3d.OBB class.
center: Center point of the OBB
axis0: Unit-length vector parallel to one axis of the OBB.
axis1: Unit-length vector parallel to the second axis of the OBB.
axis2: Unit-length vector parallel to the third axis of the OBB.
extent0: The extent (half-length) of the side parallel to axis one.
extent1: The extent (half-length) of the side parallel to axis two.
extent2: The extent (half-length) of the side parallel to axis three.
Throws System.ArgumentException: Thrown when initialization fails.

Tekla.Structures.Geometry3d.OBB.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector[],System.Double[])
Initializes a new instance of the Tekla.Structures.Geometry3d.OBB class.
center: Center point of the OBB.
axis: Three element array of unit-length vectors parallel the axis of the OBB.
extent: Three element array of the OBB extents (half-lengths of the edges).
Throws System.ArgumentException: Thrown when initialization fails.

Tekla.Structures.Geometry3d.OBB.#ctor(Tekla.Structures.Geometry3d.OBB)
Initializes a new instance of the Tekla.Structures.Geometry3d.OBB class.
obb: OBB to be copied.
Throws System.ArgumentException: Thrown when initialization fails.

Tekla.Structures.Geometry3d.OBB.Center
Gets or sets the center point of the box.
Throws System.ArgumentNullException: Thrown when null is assigned to the property.
Throws System.ArgumentException: Thrown when setting the value fails.

Tekla.Structures.Geometry3d.OBB.Axis0
Gets an axis parallel to one side of the OBB,
a unit-length vector orthogonal to Axis1 and Axis2.

Tekla.Structures.Geometry3d.OBB.Axis1
Gets an axis parallel to the second side of the OBB,
a unit-length vector orthogonal to Axis0 and Axis2.

Tekla.Structures.Geometry3d.OBB.Axis2
Gets an axis parallel to the third side of the OBB,
a unit-length vector orthogonal to Axis0 and Axis1.

Tekla.Structures.Geometry3d.OBB.Extent0
Gets or sets the extent parallel to Axis0.
Throws System.ArgumentException: Thrown when setting the value fails.

Tekla.Structures.Geometry3d.OBB.Extent1
Gets or sets the extent parallel to Axis1.
Throws System.ArgumentException: Thrown when setting the value fails.

Tekla.Structures.Geometry3d.OBB.Extent2
Gets or sets the extent parallel to Axis2.
Throws System.ArgumentException: Thrown when setting the value fails.

Tekla.Structures.Geometry3d.OBB.SetAxis(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Sets the Axis to the OBB.
axis0: Unit-length vector parallel to one axis of the OBB.
axis1: Unit-length vector parallel to the second axis of the OBB.
axis2: Unit-length vector parallel to the third axis of the OBB.
Throws System.ArgumentException: Thrown when setting the axis fails.

Tekla.Structures.Geometry3d.OBB.SetAxis(Tekla.Structures.Geometry3d.Vector[])
Sets the Axis to the OBB.
axis: Three element array of unit-length vectors parallel the axis of the OBB.
Throws System.ArgumentException: Thrown when setting the axis fails.

Tekla.Structures.Geometry3d.OBB.SetExtent(System.Double,System.Double,System.Double)
Sets the extents to the OBB.
extent0: The extent (half-length) of the side parallel to axis one.
extent1: The extent (half-length) of the side parallel to axis two.
extent2: The extent (half-length) of the side parallel to axis three.
Throws System.ArgumentException: Thrown when setting the extent fails.

Tekla.Structures.Geometry3d.OBB.SetExtent(System.Double[])
Sets the extents to the OBB.
extent: Three element array of the OBB extents (half-lengths of the edges).
Throws System.ArgumentException: Thrown when setting the extent fails.

Tekla.Structures.Geometry3d.OBB.ComputeVertices
Calculates the corner points of the OBB.
Returns: Array of corner points.

Tekla.Structures.Geometry3d.OBB.Equals(System.Object)
Tests for the exact equality of two OBBs.
obj: Object to compare.
Returns: True if the OBBs are equal, otherwise false.

Tekla.Structures.Geometry3d.OBB.Equals(Tekla.Structures.Geometry3d.OBB)
Tests for the exact equality of two OBBs.
other: OBB to compare.
Returns: True if the OBBs are equal, otherwise false.

Tekla.Structures.Geometry3d.OBB.GetHashCode
Gets the hash code for the obb.
Returns: Hash code for the obb.

Tekla.Structures.Geometry3d.OBB.ClosestPointTo(Tekla.Structures.Geometry3d.Point)
Calculates the closest point in OBB to given point.
point: Point to calculate against.
Returns: Closest point in OBB to given point.
Throws System.ArgumentNullException: Thrown when null is assigned to the point parameter.

Tekla.Structures.Geometry3d.OBB.ClosestPointTo(Tekla.Structures.Geometry3d.Line)
Calculates the closest point in OBB to given Line.
line: Line to calculate against.
Returns: Closest point in OBB to given Line.
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.ClosestPointTo(Tekla.Structures.Geometry3d.LineSegment)
Calculates the closest point in OBB to given LineSegment.
lineSegment: LineSegment to calculate against.
Returns: Closest point in OBB to given LineSegment.
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.DistanceTo(Tekla.Structures.Geometry3d.Point)
Calculates the distance from OBB to given point.
point: Point to calculate against.
Returns: Distance from OBB to given point.
Throws System.ArgumentNullException: Thrown when null is assigned to the point parameter.

Tekla.Structures.Geometry3d.OBB.DistanceTo(Tekla.Structures.Geometry3d.Line)
Calculates the distance from OBB to given Line.
line: Line to calculate against.
Returns: Distance from OBB to given Line.
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.DistanceTo(Tekla.Structures.Geometry3d.LineSegment)
Calculates the distance from OBB to given LineSegment.
lineSegment: LineSegment to calculate against.
Returns: Distance from OBB to given LineSegment.
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.IntersectionPointsWith(Tekla.Structures.Geometry3d.Line)
Calculates the intersection points between OBB and given Line.
line: Line to calculate against.
Returns: Array of intersection points.
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.IntersectionPointsWith(Tekla.Structures.Geometry3d.LineSegment)
Calculates the intersection points between OBB and given LineSegment.
lineSegment: LineSegment to calculate against.
Returns: Array of intersection points.
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.IntersectionWith(Tekla.Structures.Geometry3d.Line)
Creates an intersection between the OBB and the given Line.
line: Line to calculate against
Returns: Intersection as LineSegment or null if no intersection was found.
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.IntersectionWith(Tekla.Structures.Geometry3d.LineSegment)
Creates an intersection between the OBB and the given LineSegment.
lineSegment: LineSegment to calculate against
Returns: Intersection as LineSegment or null if no intersection was found.
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.Intersects(Tekla.Structures.Geometry3d.OBB)
Tests if current OBB intersects with the given OBB
obb: OBB to test against
Returns: True if the OBBs intersect, otherwise false
Throws System.ArgumentNullException: Thrown when null is assigned to the obb parameter.

Tekla.Structures.Geometry3d.OBB.Intersects(Tekla.Structures.Geometry3d.Line)
Tests if current OBB intersects with the given Line
line: Line to test against
Returns: True if the OBB intersects with the given Line, otherwise false
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.Intersects(Tekla.Structures.Geometry3d.LineSegment)
Tests if current OBB intersects with the given LineSegment
lineSegment: LineSegment to test against
Returns: True if the OBB intersects with the given LineSegment, otherwise false
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.Intersects(Tekla.Structures.Geometry3d.GeometricPlane)
Tests if current OBB intersects with the given GeometricPlane
geometricPlane: GeometricPlane to test against
Returns: True if the OBB intersects with the given GeometricPlane, otherwise false
Throws System.ArgumentNullException: Thrown when null is assigned to the geometricPlane parameter.

Tekla.Structures.Geometry3d.OBB.ShortestSegmentTo(Tekla.Structures.Geometry3d.Line)
Calculates the shortest LineSegment from OBB to the given Line.
line: Line to calculate against
Returns: Shortest LineSegment from OBB to the given Line.
Throws System.ArgumentNullException: Thrown when null is assigned to the line parameter.

Tekla.Structures.Geometry3d.OBB.ShortestSegmentTo(Tekla.Structures.Geometry3d.LineSegment)
Calculates the shortest LineSegment from OBB to the given LineSegment.
lineSegment: LineSegment to calculate against
Returns: Shortest LineSegment from OBB to the given LineSegment.
Throws System.ArgumentNullException: Thrown when null is assigned to the lineSegment parameter.

Tekla.Structures.Geometry3d.OBB.ShortestSegmentTo(Tekla.Structures.Geometry3d.Point)
Calculates the shortest LineSegment from OBB to the given point.
point: Point to calculate against.
Returns: Shortest LineSegment from OBB to the given point.
Throws System.ArgumentNullException: Thrown when null is assigned to the point parameter.

Tekla.Structures.Geometry3d.OBB.CollectionValid(System.Collections.ICollection,System.Int32)
Checks the validity of the given ICollection and performs null checks to items in the collection.
collection: ICollection to be checked.
sizeDemand: Size demand for the Collection.
Returns: True if collection is valid, otherwise false.

Tekla.Structures.Geometry3d.OBB.CollectionValid(System.Collections.ICollection,System.Int32,System.Boolean)
Checks the validity of given ICollection.
collection: ICollection to be checked.
sizeDemand: Size demand for the Collection.
includeItemNullCheck: Specifies whether a null check should be done for collection items.
Returns: True if collection is valid, otherwise false.

Tekla.Structures.Geometry3d.OBB.InitializeOBBInternal
Initializes the default internal obb.

Tekla.Structures.Geometry3d.OBB.InitializeOBBInternal(Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3,Tekla.Common.Geometry.UnitVector3,Tekla.Common.Geometry.UnitVector3,System.Double,System.Double,System.Double)
Initializes the internal obb.
center: Center point of the OBB
axis0: Unit-length vector parallel to one axis of the OBB.
axis1: Unit-length vector parallel to the second axis of the OBB.
axis2: Unit-length vector parallel to the third axis of the OBB.
extent0: The extent (half-length) of the side parallel to axis one.
extent1: The extent (half-length) of the side parallel to axis two.
extent2: The extent (half-length) of the side parallel to axis three.
Throws System.ArgumentException: Thrown when initialization fails.

Tekla.Structures.Geometry3d.OBB.UpdateOBBInternal(Tekla.Common.Geometry.Vector3)
Updates the internal obb with center point.
center: Center point of the OBB
Throws System.ArgumentException: Thrown when update fails.

Tekla.Structures.Geometry3d.OBB.UpdateOBBInternal(Tekla.Common.Geometry.UnitVector3[])
Updates the internal obb with axis.
axis: Three element array of unit-length vectors parallel the axis of the OBB.
Throws System.ArgumentException: Thrown when update fails.

Tekla.Structures.Geometry3d.OBB.UpdateOBBInternal(System.Double[])
Updates the internal obb with extent.
extent: Three element array of the OBB extents (half-lengths of the edges).
Throws System.ArgumentException: Thrown when update fails.